; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-1-212)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-3 - location
	p0-1 - location
	p0-3 - location
	p2-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s3)
	(at driver5 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 1)
	(= (time-to-walk p1-3 s1) 1)
	(= (time-to-walk s3 p1-3) 5)
	(= (time-to-walk p1-3 s3) 5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 7)
	(= (time-to-walk p0-1 s0) 7)
	(= (time-to-walk s1 p0-1) 1)
	(= (time-to-walk p0-1 s1) 1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 3)
	(= (time-to-walk p0-3 s0) 3)
	(= (time-to-walk s3 p0-3) 7)
	(= (time-to-walk p0-3 s3) 7)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 1)
	(= (time-to-walk p2-0 s2) 1)
	(= (time-to-walk s0 p2-0) 3)
	(= (time-to-walk p2-0 s0) 3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 5)
	(= (time-to-drive s1 s0) 5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 6)
	(= (time-to-drive s3 s0) 6)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 4)
	(= (time-to-drive s0 s2) 4)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 2)
	(= (time-to-drive s2 s3) 2)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 6)
	(= (time-to-drive s2 s1) 6)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 6)
	(= (time-to-drive s3 s1) 6)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s0)
	(at driver4 s1)
	(at driver5 s2)
	(at truck1 s1)
	(at truck2 s1)
	(at truck3 s0)
	(at truck4 s1)
	(at package1 s1)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 2 of 8
2. (walk driver2 p0-3 s0)
   deleted: (at driver2 p0-3)
   added: (at driver2 s0)
   goals met: 3 of 8
3. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 8
4. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 60
   goals met: 4 of 8
5. (walk driver4 s3 p1-3)
   deleted: (at driver4 s3)
   added: (at driver4 p1-3)
   goals met: 4 of 8
6. (walk driver4 p1-3 s1)
   deleted: (at driver4 p1-3)
   added: (at driver4 s1)
   goals met: 5 of 8
7. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 8
8. (drive-truck truck4 s0 s3 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 60 to 120
   goals met: 4 of 8
9. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 4 of 8
10. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 4 of 8
11. (drive-truck truck3 s3 s0 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 120 to 180
   goals met: 5 of 8
12. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 6 of 8
13. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 8
14. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 180 to 240
   goals met: 5 of 8
15. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 5 of 8
16. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 5 of 8
17. (walk driver2 p0-3 s0)
   deleted: (at driver2 p0-3)
   added: (at driver2 s0)
   goals met: 6 of 8
18. (drive-truck truck1 s1 s3 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 240 to 300
   goals met: 5 of 8
19. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 5 of 8
20. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 8
21. (drive-truck truck4 s3 s1 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 300 to 360
   goals met: 6 of 8
22. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 5 of 8
23. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 5 of 8
24. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 8
25. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 360 to 420
   goals met: 5 of 8
26. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 6 of 8
27. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 5 of 8
28. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 5 of 8
29. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 5 of 8
30. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 5 of 8
31. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 8
32. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 5 of 8
33. (walk driver2 p0-3 s0)
   deleted: (at driver2 p0-3)
   added: (at driver2 s0)
   goals met: 6 of 8
34. (drive-truck truck4 s1 s3 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 420 to 480
   goals met: 5 of 8
35. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 5 of 8
36. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 8
37. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 480 to 540
   goals met: 6 of 8
38. (walk driver4 s1 p1-3)
   deleted: (at driver4 s1)
   added: (at driver4 p1-3)
   goals met: 5 of 8
39. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 540 to 590
   goals met: 6 of 8
40. (walk driver4 p1-3 s3)
   deleted: (at driver4 p1-3)
   added: (at driver4 s3)
   goals met: 6 of 8
41. (board-truck driver4 truck4 s3)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 6 of 8
42. (drive-truck truck4 s3 s1 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 590 to 650
   goals met: 7 of 8
43. (disembark-truck driver4 truck4 s1)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 8 of 8
